Catalogs/ra_KontrolnyeMeropriyatiya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ra_KontrolnyeMeropriyatiya</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VidPredmetaNesootvetstviya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_VidyPredmetovNesootvetstviya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NaimenovanieEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OblastPrimeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_OblastiPrimeneniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NormativnyjSrokProvedeniya</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Primenenie</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EhtapVyyavleniya</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ra_EhtapyVyyavleniyaNesootvetstvij</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ra_KontrolnyeMeropriyatiya/Forms/ФормаГруппы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьТаблицуИспользования();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьТаблицуИспользования();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Primenenie.Очистить();
	Для Каждого СтрокаТЗ Из ТаблицаПрименения Цикл
		Если СтрокаТЗ.Использование Тогда
			СтрокаТЧ = ТекущийОбъект.Primenenie.Добавить();
			СтрокаТЧ.EhtapVyyavleniya = СтрокаТЗ.Этап;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуИспользования()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка КАК Этап,
	|	ВЫБОР
	|		КОГДА ra_KontrolnyeMeropriyatiyaPrimenenie.EhtapVyyavleniya ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование
	|ИЗ
	|	Справочник.ra_EhtapyVyyavleniyaNesootvetstvij КАК ra_EhtapyVyyavleniyaNesootvetstvij
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ra_KontrolnyeMeropriyatiya.Primenenie КАК ra_KontrolnyeMeropriyatiyaPrimenenie
	|		ПО ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка = ra_KontrolnyeMeropriyatiyaPrimenenie.EhtapVyyavleniya
	|			И ra_KontrolnyeMeropriyatiyaPrimenenie.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ ra_EhtapyVyyavleniyaNesootvetstvij.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаПрименения.Загрузить(Запрос.Выполнить().Выгрузить());
				
КонецПроцедуры

#КонецОбласти
